tps/pause_multiplier_5.txt
Script started on 2026-02-20 15:05:56+09:00 [TERM="tmux-256color" TTY="/dev/pts/2" COLUMNS="229" LINES="65"]
1024
🐬 ~/mysql_test/tps @ann🐢 
$> =eecho ''s'e't' 'innodb_spin_wait_pause_multiplier = 5'innodb_spin_wait_pause_multiplier = 5>
kecho\set innodb_spin_wait_pause_multiplier = 5
🦔 ~/mysql_test/tps @ann🐐 
$> =eecho 'set innodb_spin_wait_pause_multiplier = 5'delay = 20'                     0' >
kecho\spin_wait_delay = 0
🐒 ~/mysql_test/tps @ann🐐 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            373884
        write:                           106204
        other:                           53174
        total:                           533262
    transactions:                        26468  (440.78 per sec.)
    queries:                             533262 (8880.53 per sec.)
    ignored errors:                      238    (3.96 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0465s
    total number of events:              26468

Latency (ms):
         min:                                    4.95
         avg:                                   72.57
         max:                                  394.41
         95th percentile:                      150.29
         sum:                              1920691.84

Threads fairness:
    events (avg/stddev):           827.1250/20.72
    execution time (avg/stddev):   60.0216/0.01

🐧 ~/mysql_test/tps @ann🐣 
$> =eecho 'spin_wait_delay = 0'' 1'>
kecho\spin_wait_delay = 1
🐺 ~/mysql_test/tps @ann🐊 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            375508
        write:                           106669
        other:                           53401
        total:                           535578
    transactions:                        26579  (442.59 per sec.)
    queries:                             535578 (8918.43 per sec.)
    ignored errors:                      243    (4.05 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0510s
    total number of events:              26579

Latency (ms):
         min:                                    5.41
         avg:                                   72.27
         max:                                  398.86
         95th percentile:                      150.29
         sum:                              1920762.60

Threads fairness:
    events (avg/stddev):           830.5938/20.83
    execution time (avg/stddev):   60.0238/0.01

🦭 ~/mysql_test/tps @ann🦭 
$> =eecho 'spin_wait_delay = 6()defaultdefault );>
quote> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
kecho\spin_wait_delay = 6(default);

🐰 ~/mysql_test/tps @ann🦊 
$> =echo 'spin_wait_delay = 6(default);
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            373912
        write:                           106159
        other:                           53158
        total:                           533229
    transactions:                        26450  (440.48 per sec.)
    queries:                             533229 (8880.04 per sec.)
    ignored errors:                      258    (4.30 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0459s
    total number of events:              26450

Latency (ms):
         min:                                    5.08
         avg:                                   72.62
         max:                                  304.41
         95th percentile:                      150.29
         sum:                              1920692.08

Threads fairness:
    events (avg/stddev):           826.5625/22.87
    execution time (avg/stddev):   60.0216/0.01

🐐 ~/mysql_test/tps @ann🐺 
$> =eecho 'spin_wait_deya  lay = 20'>
kecho\spin_wait_delay = 20
🐧 ~/mysql_test/tps @ann🐻 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            371588
        write:                           105555
        other:                           52848
        total:                           529991
    transactions:                        26306  (438.10 per sec.)
    queries:                             529991 (8826.55 per sec.)
    ignored errors:                      236    (3.93 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0430s
    total number of events:              26306

Latency (ms):
         min:                                    5.38
         avg:                                   73.01
         max:                                  321.46
         95th percentile:                      150.29
         sum:                              1920615.41

Threads fairness:
    events (avg/stddev):           822.0625/22.23
    execution time (avg/stddev):   60.0192/0.01

🐢 ~/mysql_test/tps @ann🐧 
$> =eexit>
kexit\
Script done on 2026-02-20 15:19:41+09:00 [COMMAND_EXIT_CODE="0"]