tps/spin_loops_10.txt
Script started on 2026-02-20 15:21:03+09:00 [TERM="tmux-256color" TTY="/dev/pts/2" COLUMNS="229" LINES="65"]
1024
🐊 ~/mysql_test/tps @ann🐴 
$> =eecho " 'spin_wait_delay               innodb_sync_spin_loopsinnodb_sync_spin_loopssinnodb_sync_spin_loopseinnodb_sync_spin_loopstinnodb_sync_spin_loops innodb_sync_spin_loops = 10()d)e)f)a)u)l)t):)3)0) and innodb_spin_wait_pause_multiplierinnodb_spin_wait_pause_multiplier = 6 5()d)e)f)a)u)l)t):)5)0)'>
kecho\set innodb_sync_spin_loops = 10(default:30) and innodb_spin_wait_pause_multiplier = 5(default:50)
🐪 ~/mysql_test/tps @ann🐊 
$> =eecho 'spin_pau    _wait_delay = 0; '>
kecho\spin_wait_delay = 0
🐴 ~/mysql_test/tps @ann🦈 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            375172
        write:                           106580
        other:                           53365
        total:                           535117
    transactions:                        26567  (442.44 per sec.)
    queries:                             535117 (8911.75 per sec.)
    ignored errors:                      231    (3.85 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0441s
    total number of events:              26567

Latency (ms):
         min:                                    5.70
         avg:                                   72.29
         max:                                  304.97
         95th percentile:                      150.29
         sum:                              1920644.82

Threads fairness:
    events (avg/stddev):           830.2188/26.19
    execution time (avg/stddev):   60.0202/0.01

🐳 ~/mysql_test/tps @ann🐺 
$> =s eecho 'spin_wait_delay -  = 1'>
kecho\spin_wait_delay = 1
🦈 ~/mysql_test/tps @ann🐺 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            374178
        write:                           106314
        other:                           53223
        total:                           533715
    transactions:                        26496  (441.24 per sec.)
    queries:                             533715 (8888.03 per sec.)
    ignored errors:                      231    (3.85 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0467s
    total number of events:              26496

Latency (ms):
         min:                                    5.07
         avg:                                   72.49
         max:                                  407.45
         95th percentile:                      147.61
         sum:                              1920691.46

Threads fairness:
    events (avg/stddev):           828.0000/17.81
    execution time (avg/stddev):   60.0216/0.01

🦭 ~/mysql_test/tps @ann🦭 
$> =eecho 'spin_wait_delay = 6()d)e)f)a)u)l)t)'>
kecho\spin_wait_delay = 6(default)
🐼 ~/mysql_test/tps @ann🐐 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            374332
        write:                           106297
        other:                           53223
        total:                           533852
    transactions:                        26485  (441.07 per sec.)
    queries:                             533852 (8890.55 per sec.)
    ignored errors:                      253    (4.21 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0451s
    total number of events:              26485

Latency (ms):
         min:                                    5.29
         avg:                                   72.52
         max:                                  310.00
         95th percentile:                      150.29
         sum:                              1920669.11

Threads fairness:
    events (avg/stddev):           827.6562/15.27
    execution time (avg/stddev):   60.0209/0.01

🐐 ~/mysql_test/tps @ann🐯 
$> =eecho ''s'p'i'n'-'' _'w'a'i't'_'d'e'l'a'y' '=' '2'0'>
kecho\spin_wait_delay = 20
🐰 ~/mysql_test/tps @ann🦈 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            372960
        write:                           105953
        other:                           53048
        total:                           531961
    transactions:                        26408  (439.77 per sec.)
    queries:                             531961 (8858.63 per sec.)
    ignored errors:                      232    (3.86 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0479s
    total number of events:              26408

Latency (ms):
         min:                                    5.26
         avg:                                   72.73
         max:                                  402.63
         95th percentile:                      150.29
         sum:                              1920728.05

Threads fairness:
    events (avg/stddev):           825.2500/22.00
    execution time (avg/stddev):   60.0228/0.01

🦈 ~/mysql_test/tps @ann🐒 
M🦈 ~/mysql_test/tps @ann🐒 
M🦈 ~/mysql_test/tps @ann🐒 
$> eexit; >
kexit\
Script done on 2026-02-20 16:03:23+09:00 [COMMAND_EXIT_CODE="0"]